# 파이썬 맛보기

### 자료의 형태 : 숫자형

In [2]:
a = 1
a
b = 2
a+b

3

In [3]:
# 비교
a = 1
print('a =', a)
b = 2
c = a+b
print('c =', c)

a = 1
c = 3

In [4]:
# 뺄셈
print(3-2)

1

In [5]:
# 자승
print(3**2) 
print(3**3)

9
27

In [6]:
# 나눗셈 
print(3/2)

1.5

In [7]:
# 나머지
print(7%3) 
print(3%7)

1
3

### 자료의 형태 : 문자열 
- 문자열(string)은 작은 따옴표 (') 또는 큰 따옴표 (")로 묶어 나타냄

In [8]:
d = 'Python'
print(d)
test = "Yoon"
test

Python

'Yoon'

# Pandas
- 데이터 분석을 더 편하고 효율적으로 수행하기 위해 만들어진 데이터 분석 라이브러리

In [9]:
import pandas as pd

In [12]:
# 버전 확인 
import pandas as pd
print("pandas 버전:", pd.__version__)

import matplotlib
print("matplotlib 버전:", matplotlib.__version__)

import seaborn
print("seaborn 버전:", seaborn.__version__)

pandas 버전: 1.3.4
matplotlib 버전: 3.4.3
seaborn 버전: 0.11.2

## pandas의 자료 구조 소개
- Series : 1차원 자료구조. 배열/리스트와 같은 일련의 시퀀스 데이터를 받아들임 
- DataFrame : 2차원 자료구조. 행과 열이 있는 테이블 형태의 데이터를 받아들임

### Series

In [13]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [14]:
type(obj)

pandas.core.series.Series

In [15]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [16]:
obj.index  # 색인

RangeIndex(start=0, stop=4, step=1)

In [17]:
# 위와 동일한 작업 
obj2 = pd.Series([4, 7, -5, 3])
obj2.index = ['d', 'a', 'b', 'a']
obj2.index

Index(['d', 'a', 'b', 'a'], dtype='object')

In [19]:
obj2['a'] # 일부 값 추출

a    7
a    3
dtype: int64

In [20]:
obj2['d'] = 6 # 값 변경 
obj2

d    6
a    7
b   -5
a    3
dtype: int64

In [21]:
obj2[obj2 > 0]

d    6
a    7
a    3
dtype: int64

In [22]:
obj2

d    6
a    7
b   -5
a    3
dtype: int64

In [23]:
obj2 * 2 # 2배를 해줌

d    12
a    14
b   -10
a     6
dtype: int64

In [30]:
# 값 비교
r = obj2 == [4, 7, -5, 3] # any, all 적용 가능 
r

d    False
a     True
b     True
a     True
dtype: bool

In [31]:
all(r)

False

In [32]:
any(r)

True

In [33]:
# 값 제거
obj3 = pd.Series([1, 2, 3, 4, 5])
print(obj3)
del obj3[0]
obj3

0    1
1    2
2    3
3    4
4    5
dtype: int64

1    2
2    3
3    4
4    5
dtype: int64

In [34]:
obj3 = pd.Series([1, 2, 3, 4, 5])
obj3

0    1
1    2
2    3
3    4
4    5
dtype: int64

### DataFrame

In [104]:
# 딕셔너리를 이용하여 DataFrame 생성
from numpy import nan as NA

data = {'x': ['a', 'b', NA, 'b', 'd'],
        'y': [100, 200, 150, NA, 300],
        'z': [1.5, -1.7, 3.6, 2.4, 4.2]}
data

{'x': ['a', 'b', nan, 'b', 'd'],
 'y': [100, 200, 150, nan, 300],
 'z': [1.5, -1.7, 3.6, 2.4, 4.2]}

In [105]:
df = pd.DataFrame(data)

In [26]:
df

     x      y    z
0    a  100.0  1.5
1    b  200.0 -1.7
2  NaN  150.0  3.6
3    b    NaN  2.4
4    d  300.0  4.2

In [38]:
type(df)

pandas.core.frame.DataFrame

- 데이터프레임에서 열(변수) 선택

In [39]:
# 변수 선택
df.x

0      a
1      b
2    NaN
3      b
4      d
Name: x, dtype: object

In [40]:
type(df.x)

pandas.core.series.Series

In [41]:
# 여러 개 변수 선택 
df[['x', 'z']]

     x    z
0    a  1.5
1    b -1.7
2  NaN  3.6
3    b  2.4
4    d  4.2

In [42]:
df['x']

0      a
1      b
2    NaN
3      b
4      d
Name: x, dtype: object

In [43]:
df[['x']]

     x
0    a
1    b
2  NaN
3    b
4    d

- 데이터프레임에서 행(관측치) 선택

In [44]:
df

     x      y    z
0    a  100.0  1.5
1    b  200.0 -1.7
2  NaN  150.0  3.6
3    b    NaN  2.4
4    d  300.0  4.2

In [45]:
# 조건 부여하고 만족하는 행만 추출 
df[df.y > 150]

   x      y    z
1  b  200.0 -1.7
4  d  300.0  4.2

In [46]:
df.iloc[0]

x        a
y    100.0
z      1.5
Name: 0, dtype: object

In [50]:
# is.in 활용하여 행 추출
df[df.x.isin(['a', 'b'])]

   x      y    z
0  a  100.0  1.5
1  b  200.0 -1.7
3  b    NaN  2.4

#### loc and iloc을 활용한 인덱싱 : 행/열 동시 선택 가능
- loc : **label 기반**의 2차원 인덱싱 (행에 대해서도 라벨로 색인 가능)
- iloc : 순서를 나타내는 **정수 기반**의 2차원 인덱싱
- [행, 열]

In [51]:
df

     x      y    z
0    a  100.0  1.5
1    b  200.0 -1.7
2  NaN  150.0  3.6
3    b    NaN  2.4
4    d  300.0  4.2

In [52]:
df.loc[1:2, ['y', 'z']]

       y    z
1  200.0 -1.7
2  150.0  3.6

In [53]:
df.loc[:4, ['y', 'z']]

       y    z
0  100.0  1.5
1  200.0 -1.7
2  150.0  3.6
3    NaN  2.4
4  300.0  4.2

In [54]:
df.iloc[2, [2, 1]]

z      3.6
y    150.0
Name: 2, dtype: object

In [55]:
df

     x      y    z
0    a  100.0  1.5
1    b  200.0 -1.7
2  NaN  150.0  3.6
3    b    NaN  2.4
4    d  300.0  4.2

In [56]:
df.iloc[2, :]

x      NaN
y    150.0
z      3.6
Name: 2, dtype: object

In [57]:
df.iloc[[2,1], :]

     x      y    z
2  NaN  150.0  3.6
1    b  200.0 -1.7

In [58]:
df.iloc[2] # 하나만 지정한 경우는 행 지정을 의미

x      NaN
y    150.0
z      3.6
Name: 2, dtype: object

- 행, 열 추가

In [106]:
# 새로운 변수 추가 
df['w'] = [1, 2, 3, 4, 5]
df

     x      y    z  w
0    a  100.0  1.5  1
1    b  200.0 -1.7  2
2  NaN  150.0  3.6  3
3    b    NaN  2.4  4
4    d  300.0  4.2  5

In [107]:
# 변수 추가 
df['new'] = df.y * df.z
df

     x      y    z  w     new
0    a  100.0  1.5  1   150.0
1    b  200.0 -1.7  2  -340.0
2  NaN  150.0  3.6  3   540.0
3    b    NaN  2.4  4     NaN
4    d  300.0  4.2  5  1260.0

In [108]:
# 행 추가 
df.loc[4, :] = ['f', 300, 3.5, 200, 5]
df

     x      y    z    w    new
0    a  100.0  1.5    1  150.0
1    b  200.0 -1.7    2 -340.0
2  NaN  150.0  3.6    3  540.0
3    b    NaN  2.4    4    NaN
4    f  300.0  3.5  200    5.0

- 행 또는 열 삭제 : drop, del 활용

In [81]:
# 행 삭제 
df.drop(1) # (default) inplace = False, axis = 0 (row)

     x      y    z    w    new
0    a  100.0  1.5    1  150.0
2  NaN  150.0  3.6    3  540.0
3    b    NaN  2.4    4    NaN
4    f  300.0  3.5  200    5.0

In [82]:
df

     x      y    z    w    new
0    a  100.0  1.5    1  150.0
1    b  200.0 -1.7    2 -340.0
2  NaN  150.0  3.6    3  540.0
3    b    NaN  2.4    4    NaN
4    f  300.0  3.5  200    5.0

In [83]:
# 컬럼 삭제  
df2 = df.drop(['z', 'new'], axis=1) # inplace = False, axis = 1 (columns)
df2

     x      y    w
0    a  100.0    1
1    b  200.0    2
2  NaN  150.0    3
3    b    NaN    4
4    f  300.0  200

In [109]:
# del 사용한 컬럼의 삭제
del df['w']
df

     x      y    z    new
0    a  100.0  1.5  150.0
1    b  200.0 -1.7 -340.0
2  NaN  150.0  3.6  540.0
3    b    NaN  2.4    NaN
4    f  300.0  3.5    5.0

In [110]:
df

     x      y    z    new
0    a  100.0  1.5  150.0
1    b  200.0 -1.7 -340.0
2  NaN  150.0  3.6  540.0
3    b    NaN  2.4    NaN
4    f  300.0  3.5    5.0

- 결측치 탐색 및 처리

In [97]:
# 결측치 여부 판단 
df.x.isnull()

0    False
1    False
2     True
3    False
4    False
Name: x, dtype: bool

In [98]:
df['x'].isnull()

0    False
1    False
2     True
3    False
4    False
Name: x, dtype: bool

In [99]:
df.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2   True  False  False
3  False   True  False
4  False  False  False

In [100]:
# 결측치가 아닌 관측치
df.x.notnull()

0     True
1     True
2    False
3     True
4     True
Name: x, dtype: bool

In [101]:
# 결측치의 개수 
df.x.isnull().sum()

1

In [102]:
df.isnull().sum()

x    1
y    1
z    0
dtype: int64

In [103]:
df.dropna()

   x      y    z
0  a  100.0  1.5
1  b  200.0 -1.7
4  f  300.0  3.5

In [61]:
df.dropna(subset=['x'])

   x      y    z    new
0  a  100.0  1.5  150.0
1  b  200.0 -1.7 -340.0
3  b    NaN  2.4    NaN
4  f  300.0  3.5    5.0

In [62]:
df.x.fillna('c', inplace=True)
df

   x      y    z    new
0  a  100.0  1.5  150.0
1  b  200.0 -1.7 -340.0
2  c  150.0  3.6  540.0
3  b    NaN  2.4    NaN
4  f  300.0  3.5    5.0

# 데이터 불러오기

- csv (콤마로 구분된 파일) 불러오기 : read_csv

In [63]:
titanic = pd.read_csv('data/titanic.csv')

In [64]:
type(titanic)

pandas.core.frame.DataFrame

In [65]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

- 엑셀 파일에서 데이터 읽어오기 : read_excel

In [66]:
# excel 파일 불러오기 : sheet 지정 
pd.read_excel('data/excel_ex.xlsx', 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [67]:
frame = pd.read_excel('data/excel_ex.xlsx', 'Sheet2') 
frame

   a   b message
0  1   2   hello
1  5   6   world
2  9  10     foo